//Напишите программу, которая принимает два числа от пользователя
// и выполняет арифметические операции (сложение, вычитание, умножение, деление)
// над ними, выводя результат каждой операции на экран.

Console.Write("dvvedite chislo: ");
int number1 = Convert.ToInt32(Console.ReadLine());
int number2 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine(number1 + number2);
Console.WriteLine(number1 - number2);
Console.WriteLine(number1 * number2);
Console.WriteLine(number1 / number2);
