//Создайте программу на псевдоязыке, которая объявляет различные переменные
//разных типов данных (целочисленный, вещественный, строковый и логический) 
//и выводит их значения на экран
int a= 3;
bool m= true;
string b ="Hey";
double c= 2.4;
Console.WriteLine(a);
Console.WriteLine(m);
Console.WriteLine(b);
Console.WriteLine(c);
