//Создайте калькулятор, который принимает два числа от пользователя, сохраняет их в переменных, складывает их и выводит результат.
Console.Write("Введите 1-ое число: ");
int perch = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите 2-ое число: ");
int vtorch = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Сумма чисел:  " + (perch+vtorch));