//Создайте массив чисел и выведите второй элемент._
 int[] numbers = {1,3,57,8};
 Console.WriteLine(numbers[1]);