//Напишите программу, которая принимает строку от пользователя, содержащую число, и конвертирует его в целое число. 
//Затем увеличьте это число на 5 и выведите результат. 

Console.Write("dvvedite chislo: ");
int number = Convert.ToInt32(Console.ReadLine());

Console.WriteLine(number+5);
