namespace PracticeC;
class Program
/* Напишите программу, которая принимает строку от пользователя, содержащую число, и конвертирует его в целое число. Затем увеличьте это число на 5 и выведите результат. */
{
    static void Main(string[] args)
    {
        string d = "2.1";
        float ds = 2;
        float f = float.Parse(d);
        Console.WriteLine(ds);
        Console.WriteLine(f);
    }
}
