namespace PracticeABC;
//Создать JSON файлы для интернет магазина.
//- JSON файл Описание покупателя
//- JSON файл Опсание товара
//- JSON файл который хранить информацию о покупке (кто и что купил)
class Program
{
    static void Main(string[] args)
    {
        Console.WriteLine("Hello, World!");
    }
}
