//Выведите длину массива._

int[] numbers = {1,3,57,8};
int length = numbers.Length;
Console.WriteLine(length);