//Создайте программу, которая позволяет пользователю вводить и сохранять
// имена и телефонные номера в переменных, а затем выводить их на экран.
Console.Write("Введите номер телефона: ");
string number = Console.ReadLine();
Console.Write("Введите Имя пользователя : ");
string name = Console.ReadLine(); 
Console.WriteLine("Имя пользователя: " + name );
Console.WriteLine(" Номер пользователя: " + number);